week2/day5-deployment/load_testing/stack1_apache_bench.txt

--- Testing stack1 (http://127.0.0.1:3000/api/health) ---
Running 10,000 requests with 100 concurrent users...
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /api/health
Document Length:        179 bytes

Concurrency Level:      100
Time taken for tests:   4.847 seconds
Complete requests:      10000
Failed requests:        964
   (Connect: 0, Receive: 0, Length: 964, Exceptions: 0)
Total transferred:      4188929 bytes
HTML transferred:       1788929 bytes
Requests per second:    2063.13 [#/sec] (mean)
Time per request:       48.470 [ms] (mean)
Time per request:       0.485 [ms] (mean, across all concurrent requests)
Transfer rate:          843.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:     7   48  17.9     41     149
Waiting:        2   48  17.8     41     149
Total:         10   48  18.0     41     151

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     45
  75%     47
  80%     55
  90%     80
  95%     88
  98%    102
  99%    110
 100%    151 (longest request)