week2/day5-deployment/load_testing/stack2_apache_bench.txt

--- Testing stack2 (http://127.0.0.1:8000/api/health) ---
Running 10,000 requests with 100 concurrent users...
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/health
Document Length:        65 bytes

Concurrency Level:      100
Time taken for tests:   44.416 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      3240000 bytes
HTML transferred:       650000 bytes
Requests per second:    225.14 [#/sec] (mean)
Time per request:       444.160 [ms] (mean)
Time per request:       4.442 [ms] (mean, across all concurrent requests)
Transfer rate:          71.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     5  442  71.6    415     775
Waiting:        5  442  71.5    414     775
Total:          7  442  71.5    415     775

Percentage of the requests served within a certain time (ms)
  50%    415
  66%    442
  75%    468
  80%    484
  90%    541
  95%    600
  98%    652
  99%    679
 100%    775 (longest request)